In [35]:
# Install dependencies as needed:
# pip install kagglehub[pandas-datasets]
import kagglehub
from kagglehub import KaggleDatasetAdapter

# Set the path to the file you'd like to load
file_path = "Salary_Dataset_DataScienceLovers.csv"

# Load the latest version
df = kagglehub.load_dataset(
  KaggleDatasetAdapter.PANDAS,
  "rohitgrewal/salary-data",
  file_path,
  # Provide any additional arguments like 
  # sql_query or pandas_kwargs. See the 
  # documenation for more information:
  # https://github.com/Kaggle/kagglehub/blob/main/README.md#kaggledatasetadapterpandas
)

df.head()

/tmp/ipython-input-537802582.py:10: DeprecationWarning: Use dataset_load() instead of load_dataset(). load_dataset() will be removed in a future version.
  df = kagglehub.load_dataset(

Using Colab cache for faster access to the 'salary-data' dataset.

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,Sasken,Android Developer,400000,3,Bangalore,Full Time,Android
1,4.5,Advanced Millennium Technologies,Android Developer,400000,3,Bangalore,Full Time,Android
2,4.0,Unacademy,Android Developer,1000000,3,Bangalore,Full Time,Android
3,3.8,SnapBizz Cloudtech,Android Developer,300000,3,Bangalore,Full Time,Android
4,4.4,Appoids Tech Solutions,Android Developer,600000,3,Bangalore,Full Time,Android

In [36]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Preprocessing

In [37]:
df.columns

Index(['Rating', 'Company Name', 'Job Title', 'Salary', 'Salaries Reported',
       'Location', 'Employment Status', 'Job Roles'],
      dtype='object')

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22770 entries, 0 to 22769
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Rating             22770 non-null  float64
 1   Company Name       22769 non-null  object
 2   Job Title          22770 non-null  object
 3   Salary             22770 non-null  int64
 4   Salaries Reported  22770 non-null  int64
 5   Location           22770 non-null  object
 6   Employment Status  22770 non-null  object
 7   Job Roles          22770 non-null  object
dtypes: float64(1), int64(2), object(5)
memory usage: 1.4+ MB

In [39]:
df.describe()

             Rating        Salary  Salaries Reported
count  22770.000000  2.277000e+04       22770.000000
mean       3.918213  6.953872e+05           1.855775
std        0.519675  8.843990e+05           6.823668
min        1.000000  2.112000e+03           1.000000
25%        3.700000  3.000000e+05           1.000000
50%        3.900000  5.000000e+05           1.000000
75%        4.200000  9.000000e+05           1.000000
max        5.000000  9.000000e+07         361.000000

In [40]:
df.isna().sum()

Rating               0
Company Name         1
Job Title            0
Salary               0
Salaries Reported    0
Location             0
Employment Status    0
Job Roles            0
dtype: int64

In [41]:
df['Company Name'].value_counts()

Company Name
Tata Consultancy Services         271
Amazon                            184
Infosys                           169
Accenture                         150
Cognizant Technology Solutions    144
                                 ...
AirAsia                             1
GENWI                               1
Zapbuild                            1
Nasdaq                              1
Dragon mobile                       1
Name: count, Length: 11260, dtype: int64

In [42]:
df.select_dtypes(include=['object']).nunique()

Company Name         11260
Job Title             1080
Location                10
Employment Status        4
Job Roles               11
dtype: int64

In [43]:
df['Company Name'].fillna('Unknown', inplace=True)

/tmp/ipython-input-648645954.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Company Name'].fillna('Unknown', inplace=True)

In [44]:
df['Company Name'].isna().sum()

np.int64(0)

In [45]:
category_cols=df.select_dtypes(include=['object']).columns.tolist()
category_cols

['Company Name', 'Job Title', 'Location', 'Employment Status', 'Job Roles']

In [46]:

for col in category_cols:
    print(f"{col}: {df[col].nunique()} unique values")
    print('-'*20)

Company Name: 11261 unique values
--------------------
Job Title: 1080 unique values
--------------------
Location: 10 unique values
--------------------
Employment Status: 4 unique values
--------------------
Job Roles: 11 unique values
--------------------

In [47]:
def one_hot_function(
   df_input,
   df_output,   
):
    df_encoded=pd.get_dummies(df_input, dtype=int, drop_first=True)
    return pd.concat([df_output, df_encoded], axis=1)

In [48]:
one_hot_encoded_cols=['Job Roles', 'Employment Status', 'Location']

for col in one_hot_encoded_cols:
    df=one_hot_function(df[[col]], df)
    df.drop(columns=[col], inplace=True)

In [49]:
df.head()

,Rating,Company Name,Job Title,Salary,Salaries Reported,Job Roles_Backend,Job Roles_Database,Job Roles_Frontend,Job Roles_IOS,Job Roles_Java,...,Employment Status_Trainee,Location_Chennai,Location_Hyderabad,Location_Jaipur,Location_Kerala,Location_Kolkata,Location_Madhya Pradesh,Location_Mumbai,Location_New Delhi,Location_Pune
0,3.8,Sasken,Android Developer,400000,3,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,4.5,Advanced Millennium Technologies,Android Developer,400000,3,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,4.0,Unacademy,Android Developer,1000000,3,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,3.8,SnapBizz Cloudtech,Android Developer,300000,3,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,4.4,Appoids Tech Solutions,Android Developer,600000,3,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [50]:
cols_kmeans=['Job Title']

In [51]:
cols_target_econded=['Company Name']

## K_means

In [53]:
job_titles=df[cols_kmeans]

job_titles.head()

           Job Title
0  Android Developer
1  Android Developer
2  Android Developer
3  Android Developer
4  Android Developer

### TF-IDF

## Target encoding

# Simple Linear regression

# Multiple linear regreesion

# Regulazation

# gradient descent